// Project 11.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include<iostream>
#include <clocale> 
#include <string>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    double a, b, d;
    int n, i;
    cout << "Введите число:" << endl;
    cin >> a;
    b = a;
    d = a;
    cout << "Введите степень:" << endl;
    cin >> n;
    if (n > 0)
    {
        for (i = 1; i < n; i++)
        {
            a = d * b;
            d = a;
        }
    }
    else if (n < 0)
    {
        a = 1;
        for (i = 0; i > n; i = i - 1)
        {
            a = a / b;
        }
    }
    else if (n == 0)
    {
        a = 1;
    }
    cout << a << endl;
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
